src/InformationRegisters/НастройкиУчетаМаркируемойПродукцииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаМаркируемойПродукцииИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбязательногоВключенияРазрешительногоРежима</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиУчетаМаркируемойПродукцииИСМП/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	МассивНепроверяемыхРеквизитов.Добавить("ДатаОбязательнойМаркировки");
	МассивНепроверяемыхРеквизитов.Добавить("ДатаОбязательногоВключенияРазрешительногоРежима");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	МассивТГОбязательнойОнлайнПроверки = ИнтеграцияИСМПКлиентСерверПовтИсп.ВидыПродукцийОбязательнойОнлайнПроверкиПередРозничнойПродажей();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не Запись.ВестиУчетПродукции Тогда
			Продолжить;
		КонецЕсли;
		
		Если Запись.ДатаОбязательнойМаркировки = '00010101' Тогда
			ТекстОшибки = НСтр("ru = 'Для маркируемой продукции ""%1"" не указана дата обязательной маркировки'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Запись.ВидПродукции);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ДатаОбязательнойМаркировки", "Запись", Отказ);
		КонецЕсли;
		
		Если Запись.ДатаОбязательногоВключенияРазрешительногоРежима = '00010101'
			И МассивТГОбязательнойОнлайнПроверки.Найти(Запись.ВидПродукции) <> Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Для маркируемой продукции ""%1"" не указана дата включения обязательного разрешительного режима розничной проверки'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Запись.ВидПродукции);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,, "ДатаОбязательногоВключенияРазрешительногоРежима", "Запись", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеУчитываемыеТГОбязательнойОнлайнПроверки = ИнтеграцияИСМПВызовСервера.СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницу();
	
	Если ТекущиеУчитываемыеТГОбязательнойОнлайнПроверки.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	МассивТГОбязательнойОнлайнПроверки             = ИнтеграцияИСМПКлиентСерверПовтИсп.ВидыПродукцийОбязательнойОнлайнПроверкиПередРозничнойПродажей();
	ЗапуститьПервоеВключениеТГОбязательнойПроверки = Ложь;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если МассивТГОбязательнойОнлайнПроверки.Найти(Запись.ВидПродукции) <> Неопределено И Запись.ВестиУчетПродукции Тогда
			
			ЗапуститьПервоеВключениеТГОбязательнойПроверки = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗапуститьПервоеВключениеТГОбязательнойПроверки Тогда
		ДополнительныеСвойства.Вставить("ЗапуститьФоновоеОбновлениеНастроекРазрешительногоРежима", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
